matthewbarondeau/Self-Monitor-for-Detecting-Stress-Levels/Embedded Systems and Firmware/Self Monitor Stress System/driverlib/MSP432P4xx/i2c.c
/*
 * -------------------------------------------
 *    MSP432 DriverLib - v3_21_00_05 
 * -------------------------------------------
 *
 * --COPYRIGHT--,BSD,BSD
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
#include "i2c.h"
#include "interrupt.h"
#include "debug.h"
#include "hw_memmap.h"

//B0 originally
// B1 now
void I2C_writeRegister(uint32_t module, uint8_t reg, uint8_t value){
    while(I2C_masterIsStartSent(EUSCI_B1_BASE));
    I2C_masterSendMultiByteStart(EUSCI_B1_BASE, reg);  // Start + 1Byte
    while(!(EUSCI_B1->IFG & EUSCI_B_IFG_TXIFG0));
    I2C_masterSendMultiByteNext(EUSCI_B1_BASE, value);
    //I2C_masterSendMultiByteNext(EUSCI_B0_BASE, value); // Poll for TXINT,Send 1Byte
    while(!(EUSCI_B1->IFG & EUSCI_B_IFG_TXIFG0));
    EUSCI_B1->CTLW0 |= EUSCI_B_CTLW0_TXSTP;
    while (I2C_masterIsStopSent(EUSCI_B1_BASE));

}

uint8_t I2C_readRegister(uint32_t module, uint8_t reg){
    uint8_t RXData;

    //while (I2C_masterIsStopSent(EUSCI_B0_BASE) == EUSCI_B_I2C_SENDING_STOP);

    /* Send out EEPROM Mock Read Cmd (2 databytes) */
    I2C_masterSendMultiByteStart(EUSCI_B1_BASE, reg);  // Start + 1Byte


    //MAP_I2C_masterSendMultiByteFinish(EUSCI_B0_BASE, reg); // Poll for TXINT,Send 1Byte
    /*---------------------------------------------*/
    /* Now we need to initiate the read */
    /* Wait until 2nd Byte has been output to shift register */
    while(!(EUSCI_B1->IFG & EUSCI_B_IFG_TXIFG0));

    // Send the restart condition, read one byte, send the stop condition right away
    EUSCI_B1->CTLW0 &= ~(EUSCI_B_CTLW0_TR);
    EUSCI_B1->CTLW0 |= EUSCI_B_CTLW0_TXSTT;

    while(I2C_masterIsStartSent(EUSCI_B1_BASE));

    EUSCI_B1->CTLW0 |= EUSCI_B_CTLW0_TXSTP;

    while(!(EUSCI_B1->IFG & EUSCI_B_IFG_RXIFG0));
    RXData = EUSCI_B1->RXBUF;

    return RXData;
}

void I2C_writeRegister2(uint32_t module, uint8_t reg, uint8_t value){
    while(I2C_masterIsStartSent(EUSCI_B2_BASE));
    I2C_masterSendMultiByteStart(EUSCI_B2_BASE, reg);  // Start + 1Byte
    while(!(EUSCI_B2->IFG & EUSCI_B_IFG_TXIFG0));
    I2C_masterSendMultiByteNext(EUSCI_B2_BASE, value);
    //I2C_masterSendMultiByteNext(EUSCI_B0_BASE, value); // Poll for TXINT,Send 1Byte
    while(!(EUSCI_B2->IFG & EUSCI_B_IFG_TXIFG0));
    EUSCI_B2->CTLW0 |= EUSCI_B_CTLW0_TXSTP;
    while (I2C_masterIsStopSent(EUSCI_B2_BASE));

}

uint8_t I2C_readRegister2(uint32_t module, uint8_t reg){
    uint8_t RXData;

    //while (I2C_masterIsStopSent(EUSCI_B0_BASE) == EUSCI_B_I2C_SENDING_STOP);

    /* Send out EEPROM Mock Read Cmd (2 databytes) */
    I2C_masterSendMultiByteStart(EUSCI_B2_BASE, reg);  // Start + 1Byte


    //MAP_I2C_masterSendMultiByteFinish(EUSCI_B0_BASE, reg); // Poll for TXINT,Send 1Byte
    /*---------------------------------------------*/
    /* Now we need to initiate the read */
    /* Wait until 2nd Byte has been output to shift register */
    while(!(EUSCI_B2->IFG & EUSCI_B_IFG_TXIFG0));

    // Send the restart condition, read one byte, send the stop condition right away
    EUSCI_B2->CTLW0 &= ~(EUSCI_B_CTLW0_TR);
    EUSCI_B2->CTLW0 |= EUSCI_B_CTLW0_TXSTT;

    while(I2C_masterIsStartSent(EUSCI_B2_BASE));

    EUSCI_B2->CTLW0 |= EUSCI_B_CTLW0_TXSTP;

    while(!(EUSCI_B2->IFG & EUSCI_B_IFG_RXIFG0));
    RXData = EUSCI_B2->RXBUF;

    return RXData;
}

void I2C_bitMask(uint32_t module, uint8_t reg, uint8_t mask, uint8_t thing){
    uint8_t value = I2C_readRegister(module, reg);
    value = value & mask;
    I2C_writeRegister(module, reg, value | thing);
}

uint8_t I2C_getByte(uint32_t moduleInstance){
    // Wait until there is valid data in RXFIFO
    while(!(EUSCI_B2->IFG & EUSCI_B_IFG_RXIFG0));
    // Return the value in RXFIFO
    return I2C_slaveGetData(moduleInstance);
}

void I2C_initMaster(uint32_t moduleInstance, const eUSCI_I2C_MasterConfig *config)
{
    uint_fast16_t preScalarValue;

    ASSERT(
            (EUSCI_B_I2C_CLOCKSOURCE_ACLK == config->selectClockSource)
            || (EUSCI_B_I2C_CLOCKSOURCE_SMCLK
                    == config->selectClockSource));

    ASSERT(
            (EUSCI_B_I2C_SET_DATA_RATE_400KBPS == config->dataRate)
            || (EUSCI_B_I2C_SET_DATA_RATE_100KBPS == config->dataRate)
            || (EUSCI_B_I2C_SET_DATA_RATE_1MBPS == config->dataRate));

    ASSERT(
            (EUSCI_B_I2C_NO_AUTO_STOP == config->autoSTOPGeneration)
            || (EUSCI_B_I2C_SET_BYTECOUNT_THRESHOLD_FLAG
                    == config->autoSTOPGeneration)
            || (EUSCI_B_I2C_SEND_STOP_AUTOMATICALLY_ON_BYTECOUNT_THRESHOLD
                    == config->autoSTOPGeneration));

    /* Disable the USCI module and clears the other bits of control register */
    BITBAND_PERI(EUSCI_B_CMSIS(moduleInstance)->CTLW0,EUSCI_B_CTLW0_SWRST_OFS) =
            1;

    /* Configure Automatic STOP condition generation */
    EUSCI_B_CMSIS(moduleInstance)->CTLW1 =
            (EUSCI_B_CMSIS(moduleInstance)->CTLW1 & ~EUSCI_B_CTLW1_ASTP_MASK)
                    | (config->autoSTOPGeneration);

    /* Byte Count Threshold */
    EUSCI_B_CMSIS(moduleInstance)->TBCNT = config->byteCounterThreshold;

